package main

import (
	"fmt"
	"os"
)

var g[9][9] int //объявление сетки. g объявлена вне функции чтобы была доступна всем функциям

func canPlace(r, c, n int) bool { //можно ли поставить цифру в клетку. 3 правила судоку: 1)строка, 2)столбец, 3)квадрат не должны содержать одинаковые цифры
	for i := 0; i < 9; i++ { // i цикл, счетчик от 0 до 8
		if g[r][i] == n || g[i][c] == n { //i работаетв двух ролях: в первой половине становиться столбцом (r зафиксирован), во второй становиться строкой (c зафиксирован). проверка 1 и 2го правила судоку
			return false //если нашли цифру, значит клетка занято, return выходит немедленно, оставшиеся витки не выполняются. смысла продолжать нет, одного совпадения достаточно
		}
	}

	startRow := r / 3 * 3 //вычисление координат левого верхнего угла квадрата 3х3 (место где начинается квадрат), в котором лежит клетка. 
	startCol := c / 3 * 3 

	for i := startRow; i < startRow + 3; i++ { 
		for j := startCol; j < startCol + 3; j++ { //два цикла обходят 9 клеток квадрата 
			if g[i][j] == n { //обращение по двум индексам которые вычислили циклы выше. проверка 3го правила судоку
				return false //если нашли цифру внутри квадрата, то ставить нельзя
			}
		}
	}
	return true //если дошли до сюда, то прошли 3 правила судоку и можно ставить цифру
}

func solve() bool { //заполняет пустые клетки перебором с откатом
	for r := 0; r < 9; r++ {
		for c := 0; c < 9; c++ { //два вложенных цикла обходят все 81 клеток в поисках пустой
			if g[r][c] == 0 { //если нашли пустую клетку, дальнешее относится только к ней. занятые клетки просто пропускаются, циклы идут дальше.
				for n := 1; n <= 9; n++ { //перебирает цифры кандидаты от 1 до 9
					if canPlace(r, c, n) { //вызывает функцию
						g[r][c] = n //ставит цифру
						if solve() { //
							return true //вызов уходит в глубь. если вернулось truе то где то в глубине сетка заполнилось целиком. 
						}
						g[r][c] = 0
					}
				}
				return false //все цифры не подошли
			}
		}
	}
	return true //пустых клеток нет
}

func printGrid() { //печатает 9 строк через пробел. просто сетка
	for r := 0; r < 9; r++ {
		for c := 0; c < 9; c++ { //два цикла по всем клеткам
			fmt.Print(g[r][c]) //печатае без перевода строки, все в одну строку
			if c < 8 {
				fmt.Print(" ") //пробел печатается только между цифрами
			}
		}
		fmt.Println() //fmt.Println() без аргумента печатает только перевод строки
	}
}

func main() { //читает аргументы, проверяет, запускает остальные, печатает Error
	args := os.Args[1:] //args наша переменная, os.Args - встроенный список всего, в нем лежит список всего что напечатано в команде запуска; [1:] - срез начинается с первого элемента

	if len(args) != 9 { //проверка количество строк "если строк пришло не 9". ловит запуски с go run . и go run . 1 2 3 4 
		fmt.Println("Error")
		return
	}

	for r := 0; r < 9; r++ { 
		if len(args[r]) != 9 { //проверка на то что в каждой строке ровно 9 символов. стоит до обращения к символам чтобы программа не упало на короткой строке не успев напечатать "Error"
			fmt.Println("Error")
			return
		}
		for c := 0; c < 9; c++ { //цикл по символам внутри строки
			symbol := args[r][c] //[r] - строка номер r, [c] символ на позиции "c" внутри неё. symbol переменная для символа

			if symbol == '.' { // точка обозначает пустую клетку
				g[r][c] = 0 //в сетку кладем 0
			} else if symbol >= '1' && symbol <= '9' { //символы от '1' до '9' - это цифра
				g[r][c] = int(symbol - '0') //symbol - '0' превращает символ в число.
			} else {
				fmt.Println("Error")
				return //проверка символ не точка и не цифра - недопустимый
			}
		}
	}

	for r := 0; r < 9; r++ {
		for c := 0; c < 9; c++ {
			if g[r][c] != 0 { //обходит все клетки, интересуют только заполненные - заданные при запуске
				n := g[r][c] //запоминает цифру
				g[r][c] = 0 // и убирает из сетки. без этого canPlace нашел бы проверяемую цифру на уё же месте и всегда возвращал бы  false. и любое судоку с подсказкой объявлялось бы ошибочным
				if !canPlace(r, c, n) { //если цифру нельзя сюда поставить, то она конфликтует с такой же в строке, столбце или в квадрате
					fmt.Println("Error")
					return //эта проверка ловит одинаовые цифры  как "1...6.1.4"
				}
				g[r][c] = n //возвращает цифру на место. сетка должна остаться как была
			}
		}
	}

	if !solve() {
		fmt.Println("Error")
		return
	}
	printGrid()
}